const defaultPoemData = `

唐诗三百首

此电子版本乃由Ned Walsh于一九九二年春陆续输入。当时他是美国Columbia大学的
博士班学生。他断断续续地学习了十年的中文，其博士论文的主题将是关于北宋时
期的词。我于该年春末将全文校正一遍，并稍改Ned的格式。全本共有三百又二十首
诗，原由蘅塘退士选辑，分为六卷。以下目录中，右端列的是诗的编号。

              单维彰 1992-7-5

标点、国标版制作：方舟子

卷一、五言古诗 . . . . . . . . . . . . . . . . . . . . . . . . 001
乐府 . . . . . . . . . . . . . . . . . . . . . . . . . . 036
卷二、七言古诗 . . . . . . . . . . . . . . . . . . . . . . . . 046
乐府 . . . . . . . . . . . . . . . . . . . . . . . . . . 074
卷三、五言律诗 . . . . . . . . . . . . . . . . . . . . . . . . 090
卷四、七言律诗 . . . . . . . . . . . . . . . . . . . . . . . . 170
乐府 . . . . . . . . . . . . . . . . . . . . . . . . . . 223
卷五、五言绝句 . . . . . . . . . . . . . . . . . . . . . . . . 224
乐府 . . . . . . . . . . . . . . . . . . . . . . . . . . 253
卷六、七言绝句 . . . . . . . . . . . . . . . . . . . . . . . . 261
乐府 . . . . . . . . . . . . . . . . . . . . . . . . . . 312


001张九龄：感遇四首之一

孤鸿海上来，池潢不敢顾。
侧见双翠鸟，巢在三珠树。
矫矫珍木巅，得无金丸惧。
美服患人指，高明逼神恶。
今我游冥冥，弋者何所慕。

002张九龄：感遇四首之二

兰叶春葳蕤，桂华秋皎洁。
欣欣此生意，自尔为佳节。
谁知林栖者，闻风坐相悦。
草木有本心，何求美人折？

003张九龄：感遇四首之三

幽人归独卧，滞虑洗孤清。
持此谢高鸟，因之传远情。
日夕怀空意，人谁感至精？
飞沈理自隔，何所慰吾诚？

004张九龄：感遇四首之四

江南有丹橘，经冬犹绿林。
岂伊地气暖，自有岁寒心。
可以荐嘉客，奈何阻重深！
运命惟所遇，循环不可寻。
徒言树桃李，此木岂无阴？

005李白：下终南山过斛斯山人宿置酒

暮从碧山下，山月随人归，
却顾所来径，苍苍横翠微。
相携及田家，童稚开荆扉。
绿竹入幽径，青萝拂行衣。
欢言得所憩，美酒聊共挥。
长歌吟松风，曲尽河星稀。
我醉君复乐，陶然共忘机。

006李白：月下独酌

花间一壶酒，独酌无相亲。
举杯邀明月，对影成三人。
月既不解饮，影徒随我身。
暂伴月将影，行乐须及春。
我歌月徘徊，我舞影零乱。
醒时同交欢，醉后各分散。
永结无情游，相期邈云汉。

007李白：春思

燕草如碧丝，秦桑低绿枝。
当君怀归日，是妾断肠时。
春风不相识，何事入罗帏？

008杜甫：望岳

岱宗夫如何，齐鲁青未了。
造化钟神秀，阴阳割昏晓。
汤胸生层云，决眦入归鸟，
会当凌绝顶，一览众山小。

009杜甫：赠卫八处士

人生不相见，动如参与商。
今夕复何夕，共此灯烛光。
少壮能几时，鬓发各已苍。
访旧半为鬼，惊呼热中肠。
焉知二十载，重上君子堂。
昔别君未婚，儿女忽成行。
怡然敬父执，问我来何方。
问答乃未已，驱儿罗酒浆。
夜雨剪春韭，新炊间黄粱。
主称会面难，一举累十觞。
十觞亦不醉，感子故意长。
明日隔山岳，世事两茫茫。

010杜甫：佳人

绝代有佳人，幽居在空谷。
自云良家子，零落依草木。
关中昔丧乱，兄弟遭杀戮。
官高何足论，不得收骨肉。
世情恶衰歇，万事随转烛。
夫婿轻薄儿，新人美如玉。
合昏尚知时，鸳鸯不独宿。
但见新人笑，那闻旧人哭！
在山泉水清，出山泉水浊。
侍婢卖珠回，牵萝补茅屋。
摘花不插发，采柏动盈掬。
天寒翠袖薄，日暮倚修竹。

011杜甫：梦李白二首之一

死别已吞声，生别常恻恻。
江南瘴疠地，逐客无消息。
故人入我梦，明我长相忆。
君今在罗网，何以有羽翼？
恐非平生魂，路远不可测。
魂来枫林青，魂返关塞黑。
落月满屋梁，犹疑照颜色。
水深波浪阔，无使蛟龙得。

012杜甫：梦李白二首之二

浮云终日行，游子久不至。
三夜频梦君，情亲见君意。
告归常局促，苦道来不易。
江湖多风波，舟楫恐失坠。
出门搔白首，若负平生志。
冠盖满京华，斯人独憔悴。
孰云网恢恢，将老身反累。
千秋万岁名，寂寞身后事。

013王维：送别

下马饮君酒，问君何所之。
君言不得意，归卧南山陲。
但去莫复闻，白云无尽时。

014王维：送綦毋潜落第还乡

圣代无隐者，英灵尽来归。
遂令东山客，不得顾采薇。
既至金门远，孰云吾道非？
江淮度寒食，京洛缝春衣。
置酒长安道，同心与我违。
行当浮桂棹，未几拂荆扉。
远树带行客，孤城当落晖。
吾谋适不用，勿谓知音稀。

015王维：青溪

言入黄花川，每逐青溪水。
随山将万转，趣途无百里。
声喧乱石中，色静深松里。
漾漾泛菱荇，澄澄映葭苇。
我心素已闲，清川澹如此。
请留盘石上，垂钓将已矣。

016王维：渭川田家

斜光照墟落，穷巷牛羊归。
野老念牧童，倚杖候荆扉。
雉［句隹］麦苗秀，蚕眠桑叶稀。
田夫荷锄立，相见语依依。
即此羡闲逸，怅然吟式微。

017王维：西施咏

艳色天下重，西施宁久微。
朝为越溪女，暮作吴宫妃。
贱日岂殊众，贵来方悟稀。
邀人傅脂粉，不自著罗衣。
君宠益娇态，君怜无是非。
当时浣纱伴，莫得同车归。
持谢邻家子，效颦安可希！

018孟浩然：秋登兰山寄张五

北山白云里，隐者自怡悦。
相望始登高，心随雁飞灭。
愁因薄暮起，兴是清秋发。
时见归村人，沙行渡头歇。
天边树若荠，江畔洲如月。
何当载酒来，共醉重阳节。

019孟浩然：夏日南亭怀辛大

山光忽西落，池月渐东上。
散发乘夜凉，开轩卧闲敞。
荷风送香气，竹露滴清响。
欲取鸣琴弹，恨无知音赏。
感此怀故人，中宵劳梦想。

020孟浩然：宿业师山房待丁大不至

夕阳度西岭，群壑倏已暝。
松月生夜凉，风泉满清听。
樵人归欲尽，烟鸟栖初定。
之子期宿来，孤琴候萝径。

021王昌龄：同从弟南斋玩月忆山阴崔少府

高卧南斋时，开帷月初吐。
清辉淡水木，演漾在窗户。
苒苒几盈虚，澄澄变今古。
美人清江畔，是夜越吟苦。
千里其如何，微风吹兰杜。

022邱为：寻西山隐者不遇

绝顶一茅茨，直上三十里。
扣关无僮仆，窥室惟案几。
若非巾柴车，应是钓秋水。
差池不相见，黾勉空仰止。
草色新雨中，松声晚窗里。
及兹契幽绝，自足荡心耳。
虽无宾主意，颇得清净理。
兴尽方下山，何必待之子。

023綦毋潜：春泛若耶溪

幽意无断绝，此去随所偶。
晚风吹行舟，花路入溪口。
际夜转西壑，隔山望南斗。
潭烟飞溶溶，林月低向后。
生事且弥漫，愿为持竿叟。

024常建：宿王昌龄隐居

清溪深不测，隐处唯孤云。
松际露微月，清光犹为君。
茅亭宿花影，药院滋苔纹。
余亦谢时去，西山鸾鹤群。

025岑参：与高适薛据登慈恩寺浮图

塔势如涌出，孤高耸天宫。
登临出世界，磴道盘虚空。
突兀压神州，峥嵘如鬼工。
四角碍白日，七层摩苍穹。
下窥指高鸟，俯听闻惊风。
连山若波涛，奔凑如朝东。
青槐夹驰道，宫馆何玲珑！
秋色从西来，苍然满关中。
五陵北原上，万古青蒙蒙。
净理了可悟，胜因夙所宗。
誓将挂冠去，觉道资无穷。

026元结：贼退示官吏并序

癸卯岁，西原贼入道州，焚烧杀掠，几尽而去。明年，贼又攻永州，破邵，不犯此
州边鄙而退，岂力能制敌欤？盖蒙其伤怜而已！诸史何为忍苦征敛！故作诗一篇以
示官吏。

昔岁逢太平，山林二十年。
泉源在庭户，洞壑当门前。
井税有常期，日晏犹得眠。
忽然遭时变，数岁亲戎旃。
今来典斯郡，山夷又纷然。
城小贼不屠，人贫伤可怜。
是以陷邻境，此州独见全。
使臣将王命，岂不如贼焉！
令彼征敛者，迫之如火煎。
谁能绝人命，以作时世贤。
思欲委符节，引竿自刺船。
将家就鱼麦，归老江湖边。

027韦应物：郡斋雨中与诸文士燕集

兵卫森画戟，宴寝凝清香。
海上风雨至，逍遥池阁凉。
烦疴近消散，嘉宾复满堂。
自惭居处崇，未睹斯民康。
理会是非遣，性达形迹忘。
鲜肥属时禁，蔬果幸见尝。
俯饮一杯酒，仰聆金玉章。
神欢体自轻，意欲凌风翔。
吴中盛文史，群彦今汪洋。
方知大蕃地，岂曰财赋强。

028韦应物：初发扬子寄元大校书

凄凄去亲爱，泛泛入烟雾。
归棹洛阳人，残钟广陵树。
今朝为此别，何处还相遇。
世事波上舟，沿洄安得住。

029韦应物：寄全椒山中道士

今朝郡斋冷，忽念山中客。
涧底束荆薪，归来煮白石。
欲持一瓢酒，远慰风雨夕。
落叶满空山，何处寻行迹。

030韦应物：长安遇冯著

客从东方来，衣上灞陵雨。
问客何为来，采山因买斧。
冥冥花正开，扬扬燕新乳。
昨别今已春，鬓丝生几缕。

031韦应物：夕次盱眙县

落帆逗淮镇，停舫临孤驿。
浩浩风起波，冥冥日沈夕。
人归山郭暗，雁下芦洲白。
独夜忆秦关，听钟未眠客。

032韦应物：东郊

吏舍局终年，出郊旷清曙。
杨柳散和风，青山澹吾虑。
依丛适自憩，缘涧还复去。
微雨霭芳原，春鸠鸣何处？
乐幽心屡止，遵事迹犹遽。
终罢斯结庐，慕陶真可庶。

033韦应物：送杨氏女

永日方戚戚，出行复悠悠。
女子今有行，大江溯轻舟。
尔辈苦无恃，抚念益慈柔。
幼为长所育，两别泣不休。
对此结中肠，义往难复留！
自小阙内训，事姑贻我忧。
赖兹托令门，仁恤庶无尤。
贫俭诚所尚，资从岂待周？
孝恭遵妇道，容止顺其猷。
别离在今晨，见尔当何秋。
居闲始自遣，临感忽难收。
归来视幼女，零泪缘缨流。

034柳宗元：晨诣超师院读禅经

汲井漱寒齿，清心拂尘服。
闲持贝叶书，步出东斋读。
真源了无取，忘迹世所逐。
遗言冀可冥，缮性何由熟？
道人庭宇静，苔色连深竹。
日出雾露馀，青松如膏沐。
澹然离言说，悟悦心自足。

035柳宗元：溪居

久为簪组累，幸此南夷谪。
闲依农圃邻，偶似山林客。
晓耕翻露草，夜榜响溪石。
来往不逢人，长歌楚天碧。

036王昌龄：塞上曲

蝉鸣空桑林，八月萧关道。
出塞复入塞，处处黄芦草。
从来幽并客，皆向沙场老。
莫学游侠儿，矜夸紫骝好。

037王昌龄：塞下曲

饮马渡秋水，水寒风似刀。
平沙日未没，黯黯见临洮。
昔日长城战，咸言意气高。
黄尘足今古，白骨乱蓬蒿。

038李白：关山月

明月出天山，苍茫云海间。
长风几万里，吹度玉门关。
汉下白登道，胡窥青海湾。
由来征战地，不见有人还。
戍客望边色，思归多苦颜。
高楼当此夜，叹息未应闲。

039李白：子夜四时歌：春歌

秦地罗敷女，采桑绿水边。
素手青条上，红妆白日鲜。
蚕饥妾欲去，五马莫留连。

040李白：子夜四时歌：夏歌

镜湖三百里，菡萏发荷花。
五月西施采，人看隘若耶。
回舟不待月，归去越王家。

041李白：子夜四时歌：秋歌

长安一片月，万户捣衣声。
秋风吹不尽，总是玉关情。
何日平胡虏，良人罢远征？

042李白：子夜四时歌：冬歌

明朝驿使发，一夜絮征袍。
素手抽针冷，那堪把剪刀。
裁缝寄远道，几日到临洮？

043李白：长干行

妾发初覆额，折花门前剧。
郎骑竹马来，绕床弄青梅。
同居长干里，两小无嫌猜。
十四为君妇，羞颜未尝开。
低头向暗壁，千唤不一回。
十五始展眉，愿同尘与灰。
常存抱柱信，岂上望夫台！
十六君远行，瞿塘滟预堆。
五月不可触，猿鸣天上哀。
门前迟行迹，一一生绿苔。
苔深不能扫，落叶秋风早。
八月蝴蝶来，双飞西园草。
感此伤妾心，坐愁红颜老。
早晚下三巴，预将书报家。
相迎不道远，直至长风沙。

044孟郊：烈女操

梧桐相待老，鸳鸯会双死。
贞妇贵殉夫，舍生亦如此。
波澜誓不起，妾心井中水。

045孟郊：游子吟

慈母手中线，游子身上衣。
临行密密缝，意恐迟迟归。
谁言寸草心，报得三春辉？

046陈子昂：登幽州台歌

前不见古人，后不见来者。
念天地之悠悠，独怆然而涕下！

047李颀：古意

男儿事长征，少小幽燕客。
赌胜马蹄下，由来轻七尺。
杀人莫敢前，须如猬毛磔。
黄云陇底白雪飞，未得报恩不能归。
辽东小妇年十五，惯弹琵琶解歌舞。
今为羌笛出塞声，使我三军泪如雨！

048李颀：送陈章甫

四月南风大麦黄，枣花未落桐叶长。
青山朝别暮还见，嘶马出门思故乡。
陈侯立身何坦荡，虬须虎眉仍大颡。
腹中贮书一万卷，不肯低头在草莽。
东门酤酒饮我曹，心轻万事皆鸿毛。
醉卧不知白日暮，有时空望孤云高。
长河浪头连天黑，津口停舟渡不得。
郑国游人未及家，洛阳行子空叹息。
闻道故林相识多，罢官昨日今如何？

049李颀：琴歌

主人有酒欢今夕，请奏鸣琴广陵客。
月照城头乌半飞，霜凄万树风入衣。
铜炉华烛烛增辉，初弹渌水后楚妃。
一声已动物皆静，四座无言星欲稀。
清淮奉使千馀里，敢告云山从此始？

050李颀：听董大弹胡笳声兼寄语弄房给事

蔡女昔造胡笳声，一弹一十有八拍。
胡人落泪沾边草，汉使断肠对归客。
古戍苍苍烽火寒，大荒沈沈飞雪白。
先拂声弦后角羽，四郊秋叶惊［扌戚］［扌戚］。
董夫子，通神明，深山窃听来妖精。
言迟更速皆应手，将往复旋如有情。
空山百鸟散还合，万里浮云阴且晴。
嘶酸雏雁失群夜，断绝胡儿恋母声。
川为静其波，鸟亦罢其鸣。
乌孙部落家乡远，逻娑沙尘哀怨生。
幽音变调忽飘洒，长风吹林雨堕瓦。
迸泉飒飒飞木末，野鹿呦呦走堂下。
长安城连东掖垣，凤凰池对青琐门。
高才脱略名与利，日夕望君抱琴至。
`; // 50 个数据

export default defaultPoemData;